export interface MoodLevel {
  min: number;
  max: number;
  text: string;
  describe: string;
  image: string;
  color: string;
}

export const MOOD_LEVELS: MoodLevel[] = [
  {
    min: 0,
    max: 3,
    text: "ใจเธอยังมีพลัง! ✨",
    describe:
      "เธอมีสุขภาพจิตดี มีสุขภาพใจแข็งแรง หลังจากนี้อย่าลืมให้เวลากับตัวเอง ดูแลใจตัวเองดีๆ กินให้อิ่ม นอนให้หลับ แล้วอย่าลืมยิ้มให้ตัวเองเยอะๆ ล่ะ",
    image: "/images/PNG/ผล/ใจเธอยังมีพลัง.PNG",
    color: "text-green-500",
  },
  {
    min: 4,
    max: 7,
    text: "ใจอยู่ในช่วงอ่อนแอ... 💤",
    describe:
      "ช่วงนี้เธอน่าจะเหนื่อย เหมือนมีเรื่องเครียดๆ จิตใจไม่สมดุล ช่วงนี้มีเรื่องอะไรที่ทำให้เธอไม่สบายใจ อึดอัดใจบ้างมั้ย ลองหาใครสักคนใช้เวลาดีๆ ร่วมกัน ระบายสิ่งที่กังวลใจให้ใครสักคนฟัง หรือจะลองดูแลใจตัวเองง่ายๆ ด้วยการปล่อยใจไปกับสิ่งที่ชอบ หาอะไรใหม่ๆ ทำ ออกกำลังกาย Work Life Balance แยกเวลางานกับเวลาส่วนตัว ลองทำมันดูนะ มันจะช่วยให้เธอเหนื่อยน้อยลง",
    image: "/images/PNG/ผล/ใจอยู่ในช่วงอ่อนแอ.PNG",
    color: "text-yellow-500",
  },
  {
    min: 8,
    max: 12,
    text: "ใจมีแผล... 🫂",
    describe:
      "ดูเหมือนว่าตอนนี้เธอกำลังรู้สึกเศร้าใจ ท้อใจ ปัญหาในชีวิตมันเยอะมากใช่มั้ย เราไม่รู้หรอกว่าตอนนี้เธอมีเรื่องอะไร แต่รู้ว่ามันหนักและเหนื่อยมาก ลองแยกแยะปัญหาให้มันเป็นส่วนย่อยๆ เพื่อลดอาการท้อแท้ ค่อยๆ แก้มันไปทีละเรื่อง อย่าคาดหวังหรือตั้งเป้าหมายยากเกินไป และช่วงนี้เป็นช่วงเวลาที่เราว่าเธอต้องการการพักผ่อนทั้งกายใจ พักก่อนนะ แต่ถ้ามันรู้สึกไม่ไหวจริงๆ เธอไปบอกเล่าความรู้สึก อาการทางใจให้ผู้เชี่ยวชาญฟังดีมั้ย เขาต้องช่วยแบ่งเบาเรื่องในใจของเธอได้แน่ๆ",
    image: "/images/PNG/ผล/ใจมีแผล.PNG",
    color: "text-orange-500",
  },
  {
    min: 13,
    max: 36,
    text: "ใจเจ็บ ต้องได้รับการดูแล... 😞",
    describe:
      "ช่วงนี้ใจเธอดูไม่ค่อยดี อาจมีความเสี่ยงสูงต่อภาวะซึมเศร้าหรือปัญหาสุขภาพใจอื่นๆ อย่าปล่อยให้ตัวเองจมอยู่ในความเครียดหรือความเศร้านานเกินไป อยากให้เธอถอยออกมา พักผ่อนให้เพียงพอ",
    image: "/images/PNG/ผล/ใจเจ็บ ต้องได้รับการดูแล.PNG",
    color: "text-red-500",
  },
];

export const getMoodByScore = (score: number): MoodLevel => {
  const mood = MOOD_LEVELS.find((m) => score >= m.min && score <= m.max);
  return mood || MOOD_LEVELS[0];
};
